AntoineMugnier/mutekh/arch/pic32/include/arch/pic32_pin.h
#include <arch/pic32_devaddr.h>

#ifndef PIC32_PIN_H_
#define PIC32_PIN_H_

#define PIC32_PA0                (0*16+0)
#define PIC32_PA1                (0*16+1)
#define PIC32_PA2                (0*16+2)
#define PIC32_PA3                (0*16+3)
#define PIC32_PA4                (0*16+4)
#define PIC32_PA5                (0*16+5)
#define PIC32_PA6                (0*16+6)
#define PIC32_PA7                (0*16+7)
#define PIC32_PA8                (0*16+8)
#define PIC32_PA9                (0*16+9)
#define PIC32_PA10               (0*16+10)
#define PIC32_PA11               (0*16+11)
#define PIC32_PA12               (0*16+12)
#define PIC32_PA13               (0*16+13)
#define PIC32_PA14               (0*16+14)
#define PIC32_PA15               (0*16+15)

#define PIC32_PB0                (1*16+0)
#define PIC32_PB1                (1*16+1)
#define PIC32_PB2                (1*16+2)
#define PIC32_PB3                (1*16+3)
#define PIC32_PB4                (1*16+4)
#define PIC32_PB5                (1*16+5)
#define PIC32_PB6                (1*16+6)
#define PIC32_PB7                (1*16+7)
#define PIC32_PB8                (1*16+8)
#define PIC32_PB9                (1*16+9)
#define PIC32_PB10               (1*16+10)
#define PIC32_PB11               (1*16+11)
#define PIC32_PB12               (1*16+12)
#define PIC32_PB13               (1*16+13)
#define PIC32_PB14               (1*16+14)
#define PIC32_PB15               (1*16+15)

#define PIC32_PC0                (2*16+0)
#define PIC32_PC1                (2*16+1)
#define PIC32_PC2                (2*16+2)
#define PIC32_PC3                (2*16+3)
#define PIC32_PC4                (2*16+4)
#define PIC32_PC5                (2*16+5)
#define PIC32_PC6                (2*16+6)
#define PIC32_PC7                (2*16+7)
#define PIC32_PC8                (2*16+8)
#define PIC32_PC9                (2*16+9)
#define PIC32_PC10               (2*16+10)
#define PIC32_PC11               (2*16+11)
#define PIC32_PC12               (2*16+12)
#define PIC32_PC13               (2*16+13)
#define PIC32_PC14               (2*16+14)
#define PIC32_PC15               (2*16+15)

#define PIC32_PD0                (3*16+0)
#define PIC32_PD1                (3*16+1)
#define PIC32_PD2                (3*16+2)
#define PIC32_PD3                (3*16+3)
#define PIC32_PD4                (3*16+4)
#define PIC32_PD5                (3*16+5)
#define PIC32_PD6                (3*16+6)
#define PIC32_PD7                (3*16+7)
#define PIC32_PD8                (3*16+8)
#define PIC32_PD9                (3*16+9)
#define PIC32_PD10               (3*16+10)
#define PIC32_PD11               (3*16+11)
#define PIC32_PD12               (3*16+12)
#define PIC32_PD13               (3*16+13)
#define PIC32_PD14               (3*16+14)
#define PIC32_PD15               (3*16+15)

#define PIC32_PE0                (4*16+0)
#define PIC32_PE1                (4*16+1)
#define PIC32_PE2                (4*16+2)
#define PIC32_PE3                (4*16+3)
#define PIC32_PE4                (4*16+4)
#define PIC32_PE5                (4*16+5)
#define PIC32_PE6                (4*16+6)
#define PIC32_PE7                (4*16+7)
#define PIC32_PE8                (4*16+8)
#define PIC32_PE9                (4*16+9)
#define PIC32_PE10               (4*16+10)
#define PIC32_PE11               (4*16+11)
#define PIC32_PE12               (4*16+12)
#define PIC32_PE13               (4*16+13)
#define PIC32_PE14               (4*16+14)
#define PIC32_PE15               (4*16+15)

#define PIC32_PF0                (5*16+0)
#define PIC32_PF1                (5*16+1)
#define PIC32_PF2                (5*16+2)
#define PIC32_PF3                (5*16+3)
#define PIC32_PF4                (5*16+4)
#define PIC32_PF5                (5*16+5)
#define PIC32_PF6                (5*16+6)
#define PIC32_PF7                (5*16+7)
#define PIC32_PF8                (5*16+8)
#define PIC32_PF9                (5*16+9)
#define PIC32_PF10               (5*16+10)
#define PIC32_PF11               (5*16+11)
#define PIC32_PF12               (5*16+12)
#define PIC32_PF13               (5*16+13)
#define PIC32_PF14               (5*16+14)
#define PIC32_PF15               (5*16+15)

#define PIC32_PG0                (6*16+0)
#define PIC32_PG1                (6*16+1)
#define PIC32_PG2                (6*16+2)
#define PIC32_PG3                (6*16+3)
#define PIC32_PG4                (6*16+4)
#define PIC32_PG5                (6*16+5)
#define PIC32_PG6                (6*16+6)
#define PIC32_PG7                (6*16+7)
#define PIC32_PG8                (6*16+8)
#define PIC32_PG9                (6*16+9)
#define PIC32_PG10               (6*16+10)
#define PIC32_PG11               (6*16+11)
#define PIC32_PG12               (6*16+12)
#define PIC32_PG13               (6*16+13)
#define PIC32_PG14               (6*16+14)
#define PIC32_PG15               (6*16+15)

#define PIC32_PH0                (7*16+0)
#define PIC32_PH1                (7*16+1)
#define PIC32_PH2                (7*16+2)
#define PIC32_PH3                (7*16+3)
#define PIC32_PH4                (7*16+4)
#define PIC32_PH5                (7*16+5)
#define PIC32_PH6                (7*16+6)
#define PIC32_PH7                (7*16+7)
#define PIC32_PH8                (7*16+8)
#define PIC32_PH9                (7*16+9)
#define PIC32_PH10               (7*16+10)
#define PIC32_PH11               (7*16+11)
#define PIC32_PH12               (7*16+12)
#define PIC32_PH13               (7*16+13)
#define PIC32_PH14               (7*16+14)
#define PIC32_PH15               (7*16+15)

#define PIC32_PJ0                (8*16+0)
#define PIC32_PJ1                (8*16+1)
#define PIC32_PJ2                (8*16+2)
#define PIC32_PJ3                (8*16+3)
#define PIC32_PJ4                (8*16+4)
#define PIC32_PJ5                (8*16+5)
#define PIC32_PJ6                (8*16+6)
#define PIC32_PJ7                (8*16+7)
#define PIC32_PJ8                (8*16+8)
#define PIC32_PJ9                (8*16+9)
#define PIC32_PJ10               (8*16+10)
#define PIC32_PJ11               (8*16+11)
#define PIC32_PJ12               (8*16+12)
#define PIC32_PJ13               (8*16+13)
#define PIC32_PJ14               (8*16+14)
#define PIC32_PJ15               (8*16+15)

#define PIC32_PK0                (9*16+0)
#define PIC32_PK1                (9*16+1)
#define PIC32_PK2                (9*16+2)
#define PIC32_PK3                (9*16+3)
#define PIC32_PK4                (9*16+4)
#define PIC32_PK5                (9*16+5)
#define PIC32_PK6                (9*16+6)
#define PIC32_PK7                (9*16+7)
#define PIC32_PK8                (9*16+8)
#define PIC32_PK9                (9*16+9)
#define PIC32_PK10               (9*16+10)
#define PIC32_PK11               (9*16+11)
#define PIC32_PK12               (9*16+12)
#define PIC32_PK13               (9*16+13)
#define PIC32_PK14               (9*16+14)
#define PIC32_PK15               (9*16+15)

/** Output pin selection */

#define PIC23_OUTPUT_MUX_NOCONNECT 0

#define PIC23_OUTPUT_MUX_U1TX      1
#define PIC32_OUTPUT_MUX_U2TX      2
#define PIC32_OUTPUT_MUX_U3TX      1
#define PIC32_OUTPUT_MUX_U4TX      2
#define PIC32_OUTPUT_MUX_U5TX      3
#define PIC32_OUTPUT_MUX_U6TX      4

#define PIC32_OUTPUT_MUX_U1RTS     1
#define PIC32_OUTPUT_MUX_U2RTS     2
#define PIC32_OUTPUT_MUX_U3RTS     1
#define PIC32_OUTPUT_MUX_U4RTS     2
#define PIC32_OUTPUT_MUX_U5RTS     3
#define PIC32_OUTPUT_MUX_U6RTS     4

#define PIC32_OUTPUT_MUX_U6RTS     4

#define PIC32_OUTPUT_MUX_SDO1      5
#define PIC32_OUTPUT_MUX_SDO2      6
#define PIC32_OUTPUT_MUX_SDO3      7
#define PIC32_OUTPUT_MUX_SDO4      8
#define PIC32_OUTPUT_MUX_SDO5      9
#define PIC32_OUTPUT_MUX_SDO6      10

#define PIC32_OUTPUT_MUX_SS1       5
#define PIC32_OUTPUT_MUX_SS2       6
#define PIC32_OUTPUT_MUX_SS3       7
#define PIC32_OUTPUT_MUX_SS4       8
#define PIC32_OUTPUT_MUX_SS5       9
#define PIC32_OUTPUT_MUX_SS6       10

#define PIC32_OUTPUT_MUX_OC1       12
#define PIC32_OUTPUT_MUX_OC2       11
#define PIC32_OUTPUT_MUX_OC3       11
#define PIC32_OUTPUT_MUX_OC4       11
#define PIC32_OUTPUT_MUX_OC5       11
#define PIC32_OUTPUT_MUX_OC6       12
#define PIC32_OUTPUT_MUX_OC7       12
#define PIC32_OUTPUT_MUX_OC8       12
#define PIC32_OUTPUT_MUX_OC9       13

#define PIC32_OUTPUT_MUX_REFCLKO4  13
#define PIC32_OUTPUT_MUX_REFCLKO1  15
#define PIC32_OUTPUT_MUX_REFCLKO3  15

#define PIC32_OUTPUT_MUX_C1OUT     14
#define PIC32_OUTPUT_MUX_C2OUT     14

#define PIC32_OUTPUT_MUX_C1TX      15
#define PIC32_OUTPUT_MUX_C2TX      15

/** Input pin selection */
#define PIC32_INPUT_MUX_URX2       (PIC32_GPIO_URX_ADDR(1) - PIC32_GPIO_INPUT_MUX_OFFSET)
#define PIC32_INPUT_MUX_SDI1       (PIC32_GPIO_SDI_ADDR(0) - PIC32_GPIO_INPUT_MUX_OFFSET)
#define PIC32_INPUT_MUX_SDI2       (PIC32_GPIO_SDI_ADDR(1) - PIC32_GPIO_INPUT_MUX_OFFSET)
#define PIC32_INPUT_MUX_SDI3       (PIC32_GPIO_SDI_ADDR(2) - PIC32_GPIO_INPUT_MUX_OFFSET)

#define PIC32_INPUT_MUX_INT1       (PIC32_GPIO_INT_ADDR(0) - PIC32_GPIO_INPUT_MUX_OFFSET)
#define PIC32_INPUT_MUX_INT2       (PIC32_GPIO_INT_ADDR(1) - PIC32_GPIO_INPUT_MUX_OFFSET)
#define PIC32_INPUT_MUX_INT3       (PIC32_GPIO_INT_ADDR(2) - PIC32_GPIO_INPUT_MUX_OFFSET)
#define PIC32_INPUT_MUX_INT4       (PIC32_GPIO_INT_ADDR(3) - PIC32_GPIO_INPUT_MUX_OFFSET)
#endif
